app/Controllers/DataPpoj.php

SELECT *
FROM `data_ahu`
---
    public function index()
    {
        $AllModel = new AllModel();
        $PpojModel = new PpojModel();
        $AhuModel = new AhuModel;
        $data = [
            // 'judul' => 'Daftar Antrian'
            'List_AHU' => $AllModel->List_AHU(),
            'List_Ruangan' => $AllModel->List_Ruangan(),
            'List_PPOJ' => $AhuModel->findAll()