app/Controllers/MasterDataSwab.php

SELECT *
FROM `master_data_swab`
---
    public function index()
    {
        $session = session();
        $model = new MasterDataSwabModel();
        $data['data'] = $model->findAll();