app/Controllers/MikroAir.php

    public function index()
    {
        $session    = session();
        $model      = new DataSamplingAirModel();
        $modelTitik = new DataTitikSamplingAirModel();

        $semuaData   = $model->where('approve_1 IS NOT NULL')->findAll();
---
SELECT *
FROM `data_sampling_air`
WHERE `approve_1` IS NOT NULL