app/Controllers/OosPenyimpanganAir.php

SELECT *
FROM `oos_air`
ORDER BY `id` DESC
---
    public function TampilOOS()
    {
        $session = session();
        $model   = new OosAirModel();
        $data['data_request'] = $model->orderBy('id', 'DESC')->findAll(); // tidak pakai where

SELECT *
FROM `penyimpangan_air`
ORDER BY `id` DESC
---
    public function TampilPenyimpangan()
    {
        $session = session();
        $model   = new PenyimpanganAirModel();
        $data['data_request'] = $model->orderBy('id', 'DESC')->findAll(); // tidak pakai where