app/Models/AllModel.php

SELECT *
FROM `nama_ahu`
---
  public function List_AHU()
  {
    $session = session();

    $builder = $this->db->table("nama_ahu");
    $builder->select('*');
    $data = $builder->get()->getResultArray();

SELECT DISTINCT `nama_ruangan`
FROM `master_data`
---
  public function List_Ruangan()
  {
    $session = session();

    $builder = $this->db->table("master_data");
    $builder->DISTINCT('nama_ruangan');
    $builder->select('nama_ruangan');
    $data = $builder->get()->getResultArray();

SELECT DISTINCT `terhadap_ruangan`
FROM `master_data_dp`
---
  public function List_RuanganDp()
  {
    $session = session();

    $builder = $this->db->table("master_data_dp");
    $builder->DISTINCT('terhadap_ruangan');
    $builder->select('terhadap_ruangan');
    $data = $builder->get()->getResultArray();