app/Models/DataTitikSamplingAirModel.php

SELECT `id_sampling`, COUNT(*) as jumlah
FROM `data_titik_sampling_air`
GROUP BY `id_sampling`
---
    public function getJumlahPerSampling(): array
    {
        $rows = $this->db->table($this->table)
            ->select('id_sampling, COUNT(*) as jumlah')
            ->groupBy('id_sampling')
            ->get()->getResultArray();